YP-LXL/my-project/src/driver/gd32f4x.h
#ifndef GD32F4X_H
#define GD32F4X_H

/* gd32f4x驱动-记录 */
/* 系统时钟************************************************************************** */
/* USART调试************************************************************************** */
/* IO-输入/输出************************************************************************** */
/* 定时器************************************************************************** */
/* ADC************************************************************************** */
/* CAN************************************************************************** */
/* DMA************************************************************************** */
/* 低功耗睡眠************************************************************************** */
/* 看门狗************************************************************************** */
/* RTC************************************************************************** */

#include "common.h"
#include "ota.h"
// #include "parameter.h"
/* 系统时钟************************************************************************** */
void gd32f4x_delay_us(uint32_t nus);
void gd32f4x_delay_ms(uint16_t nms);
void gd32f4x_system_clock_init(void);


// extern uint32_t duty_data;

#define  MCU_GPIO_PIN(x,y)         x##y
#define  MCU_GPIO_(x,y)            x##y
#define  MCU_GPIO_EXTI_(x,y)       x##y

/* IO-输入/输出************************************************************************** */
/*输出,EN_SW1置高,Vbat开始给板卡通电,辅电工作*/
#define EN_SW1_APS_VBT_PIN        			MCU_GPIO_PIN(GPIO_PIN_,1)
#define EN_SW1_APS_VBT_GPIO       			MCU_GPIO_(GPIO,A)

/*输出,EN_SW2置高,Vbat开始防反接电路工作*/
#define EN_SW2_ARC_VBT_PIN        			MCU_GPIO_PIN(GPIO_PIN_,2)
#define EN_SW2_ARC_VBT_GPIO       			MCU_GPIO_(GPIO,A)

/*输出,485/CAN用的隔离芯片供电使能,常低,拉高一次即可正常供电,休眠或不使用时拉低一次才能断电(转换芯片供电)*/
#define PERIPHERAL_POWER_VDD_PIN        	MCU_GPIO_PIN(GPIO_PIN_,7)
#define PERIPHERAL_POWER_VDD_GPIO       	MCU_GPIO_(GPIO,A)

/*输出,J4的EH_DCH,EN_DCH置高,低压Vbat驱动端开始工作,升压输出*/
#define LOW_VOLTAGE_DRIVE_EN_PIN        	MCU_GPIO_PIN(GPIO_PIN_,10)
#define LOW_VOLTAGE_DRIVE_EN_GPIO       	MCU_GPIO_(GPIO,B)

/*输出,RS485(/RE)收发器的接收使能引脚*/
#define PERIPHERAL_RS485_EN_PIN        		MCU_GPIO_PIN(GPIO_PIN_,15)
#define PERIPHERAL_RS485_EN_GPIO       		MCU_GPIO_(GPIO,B)

/*输出,12V转8V电源VPRO的供电使能*/
#define VPRO12V8V_CONTROL_PIN           	MCU_GPIO_PIN(GPIO_PIN_,0)
#define VPRO12V8V_CONTROL_GPIO          	MCU_GPIO_(GPIO,C)

/*输入,J4的S_HV,高压存在后,S_HV=0,母线没高压S_HV=1*/
#define BUS_HIGH_VOLTAGE_STATE_PIN          MCU_GPIO_PIN(GPIO_PIN_,5)
#define BUS_HIGH_VOLTAGE_STATE_GPIO         MCU_GPIO_(GPIO,C)
#define BUS_HIGH_VOLTAGE_EXTI_X			    MCU_GPIO_EXTI_(EXTI_,5)

/*输入,插入检测*/
#define MS0_DET_STATE_PIN                   MCU_GPIO_PIN(GPIO_PIN_,7)
#define MS0_DET_STATE_GPIO                  MCU_GPIO_(GPIO,C)
#define MS0_DET_EXTI_X			            MCU_GPIO_EXTI_(EXTI_,7)

/*输出,发出插入信号*/
#define MS0_OUT_EN_PIN                      MCU_GPIO_PIN(GPIO_PIN_,8)
#define MS0_OUT_EN_GPIO                     MCU_GPIO_(GPIO,C)

/*输出,控制干接点继电器供电电源,高电平继电器动作,低电平继电器复位
#define DRY_CONTACT_RELAY_EN_PIN			MCU_GPIO_PIN(GPIO_PIN_,11)
#define DRY_CONTACT_RELAY_EN_GPIO  			MCU_GPIO_(GPIO,D)*/

/*AFESH367309的MOS强制控制引脚CTL,当该引脚输出低电平强制关闭充放电和预充MOS,
当该引脚输出高电平,MOS由AFE内部逻辑控制*/
#define	AFESH367309MOS_CONTR_PIN            MCU_GPIO_PIN(GPIO_PIN_,12)
#define	AFESH367309MOS_CONTR_GPIO           MCU_GPIO_(GPIO,D)

/*输入,ALARM AFE SH367309与MCU之间的通信引脚,AFE输出,MCU输入 ALARM*/
#define AFE_SH367309_ALARM_PIN		    	MCU_GPIO_PIN(GPIO_PIN_,13)
#define AFE_SH367309_ALARM_GPIO				MCU_GPIO_(GPIO,D)
#define ALARM_GPIO_EXTI_X					MCU_GPIO_EXTI_(EXTI_,13)

/*输出,SHIP 仓运状态控制*/
#define	WAREHOUSE_STAT_CONTR_PIN			MCU_GPIO_PIN(GPIO_PIN_,14)
#define	WAREHOUSE_STAT_CONTR_GPIO			MCU_GPIO_(GPIO,D)

/*输入,EN_SKY:开机按钮按下检测功能,开机按钮按下EN_SKY=0,没按下EN_SKY=1*/
#define EN_SKY_PIN          				MCU_GPIO_PIN(GPIO_PIN_,2)
#define EN_SKY_GPIO         				MCU_GPIO_(GPIO,E) 
#define EN_SKY_EXTI_X					    MCU_GPIO_EXTI_(EXTI_,2)

/*输出,EN_PWR:当开机按钮按下后辅电供电,系统自检OK后EN_PWRs输出1高,保持辅电一直提供*/
#define EN_PWR_PIN          				MCU_GPIO_PIN(GPIO_PIN_,3)
#define EN_PWR_GPIO         				MCU_GPIO_(GPIO,E) 

/*输出,J4的EH_CH,EN_CH置高,高压驱动端开始工作,降压输出*/
#define HIGH_VOLTAGE_DRIVE_EN_PIN           MCU_GPIO_PIN(GPIO_PIN_,15)
#define HIGH_VOLTAGE_DRIVE_EN_GPIO          MCU_GPIO_(GPIO,E)

/*PA0复位*/
#define PA0_OFF()                           gpio_bit_reset(MCU_GPIO_(GPIO,A),MCU_GPIO_PIN(GPIO_PIN_,0))

/*板卡通电,辅电控制开关*/
#define EN_SW1_APS_VBT_ON()                 gpio_bit_set(EN_SW1_APS_VBT_GPIO,EN_SW1_APS_VBT_PIN)
#define EN_SW1_APS_VBT_OFF()                gpio_bit_reset(EN_SW1_APS_VBT_GPIO,EN_SW1_APS_VBT_PIN)

/*防反接电路工作控制开关*/
#define EN_SW2_ARC_VBT_ON()                 gpio_bit_set(EN_SW2_ARC_VBT_GPIO,EN_SW2_ARC_VBT_PIN)
#define EN_SW2_ARC_VBT_OFF()                gpio_bit_reset(EN_SW2_ARC_VBT_GPIO,EN_SW2_ARC_VBT_PIN)

/*485/CAN用的隔离芯片供电使能控制开关*/
#define PERIPHERAL_POWER_VDD_ON()           gpio_bit_set(PERIPHERAL_POWER_VDD_GPIO,PERIPHERAL_POWER_VDD_PIN)
#define PERIPHERAL_POWER_VDD_OFF()          gpio_bit_reset(PERIPHERAL_POWER_VDD_GPIO,PERIPHERAL_POWER_VDD_PIN)

/*蜂鸣器控制开关*/
#define BUZZER_POWER_ON()                   gpio_bit_set(BUZZER_PORT,BUZZER_PIN)
#define BUZZER_POWER_OFF()                  gpio_bit_reset(BUZZER_PORT,BUZZER_PIN)

/*低压Vbat驱动端工作控制开关*/
#define LOW_VOLTAGE_DRIVE_EN_ON()           gpio_bit_set(LOW_VOLTAGE_DRIVE_EN_GPIO,LOW_VOLTAGE_DRIVE_EN_PIN)
#define LOW_VOLTAGE_DRIVE_EN_OFF()          gpio_bit_reset(LOW_VOLTAGE_DRIVE_EN_GPIO,LOW_VOLTAGE_DRIVE_EN_PIN)

/*RS485(/RE)收发器的接收使能控制开关*/
#define PERIPHERAL_RS485_EN_ON()            gpio_bit_set(PERIPHERAL_RS485_EN_GPIO,PERIPHERAL_RS485_EN_PIN)
#define PERIPHERAL_RS485_EN_OFF()           gpio_bit_reset(PERIPHERAL_RS485_EN_GPIO,PERIPHERAL_RS485_EN_PIN)

/*12V转8V电源VPRO的供电使能,这个功能是用于开启写AFE的EEPROM功能用的
开启这个功能才能写AFE的配置,写完要关闭*/
#define VPRO12V8V_CONTROL_ON()             	gpio_bit_set(VPRO12V8V_CONTROL_GPIO,VPRO12V8V_CONTROL_PIN)
#define VPRO12V8V_CONTROL_OFF()            	gpio_bit_reset(VPRO12V8V_CONTROL_GPIO,VPRO12V8V_CONTROL_PIN)

/*插入信号开关*/
#define	MS0_OUT_EN_ON()		                gpio_bit_set(MS0_OUT_EN_GPIO,MS0_OUT_EN_PIN)   
#define	MS0_OUT_EN_OFF()		            gpio_bit_reset(MS0_OUT_EN_GPIO,MS0_OUT_EN_PIN)  

