YP-LXL/my-project/src/driver/gd32f4x.h
/*AFESH367309的MOS强制控制引脚CTL*/
#define	AFESH367309MOS_ON()                 gpio_bit_set(AFESH367309MOS_CONTR_GPIO,AFESH367309MOS_CONTR_PIN)    
#define	AFESH367309MOS_OFF() 				gpio_bit_reset(AFESH367309MOS_CONTR_GPIO,AFESH367309MOS_CONTR_PIN)  
	
/*仓运状态控制*/
#define	WAREHOUSE_STAT_CONTR_IN()		    gpio_bit_reset(WAREHOUSE_STAT_CONTR_GPIO,WAREHOUSE_STAT_CONTR_PIN)
#define	WAREHOUSE_STAT_CONTR_OUT()		    gpio_bit_set(WAREHOUSE_STAT_CONTR_GPIO,WAREHOUSE_STAT_CONTR_PIN)  

/*自检状态输出*/
#define EN_PWR_ON()                		    gpio_bit_set(EN_PWR_GPIO,EN_PWR_PIN)
#define EN_PWR_OFF()               			gpio_bit_reset(EN_PWR_GPIO,EN_PWR_PIN)
		
/*高压Vbat驱动端工作控制开关*/
#define HIGH_VOLTAGE_DRIVE_EN_ON()          gpio_bit_set(HIGH_VOLTAGE_DRIVE_EN_GPIO,HIGH_VOLTAGE_DRIVE_EN_PIN)
#define HIGH_VOLTAGE_DRIVE_EN_OFF()         gpio_bit_reset(HIGH_VOLTAGE_DRIVE_EN_GPIO,HIGH_VOLTAGE_DRIVE_EN_PIN)

/******************************************************获取开关量状态*******************************************************************************/

/*板卡通电,辅电使能状态*/
#define EN_SW1_APS_VBT_STATE() 				gpio_input_bit_get(EN_SW1_APS_VBT_GPIO,EN_SW1_APS_VBT_PIN)

/*防反接电路工作状态*/
#define EN_SW2_ARC_VBT_STATE()        		gpio_input_bit_get(EN_SW2_ARC_VBT_GPIO,EN_SW2_ARC_VBT_PIN)

/*485/CAN用的隔离芯片供电使能控制开关*/
#define PERIPHERAL_POWER_VDD_STATE()		gpio_input_bit_get(PERIPHERAL_POWER_VDD_GPIO,PERIPHERAL_POWER_VDD_PIN)

/*低压Vbat驱动端工作使能状态*/
#define LOW_VOLTAGE_DRIVE_EN_STATE()     	gpio_input_bit_get(LOW_VOLTAGE_DRIVE_EN_GPIO,LOW_VOLTAGE_DRIVE_EN_PIN)

/*RS485(/RE)收发器的接收使能状态*/
#define PERIPHERAL_RS485_EN_STATE()			gpio_input_bit_get(PERIPHERAL_RS485_EN_GPIO,PERIPHERAL_RS485_EN_PIN)

/*12V转8V电源VPRO的供电使能*/
#define VPRO12V8V_CONTROL_STATE() 			gpio_input_bit_get(VPRO12V8V_CONTROL_GPIO,VPRO12V8V_CONTROL_PIN)

/*读取母线高压是否存在*/
#define BUS_HIGH_VOLTAGE_STATE() 			gpio_input_bit_get(BUS_HIGH_VOLTAGE_STATE_GPIO,BUS_HIGH_VOLTAGE_STATE_PIN)

/*控制干接点继电器供电电源使能状态*/
#define DRY_CONTACT_RELAY_EN_STATE() 		gpio_input_bit_get(DRY_CONTACT_RELAY_EN_GPIO,DRY_CONTACT_RELAY_EN_PIN)

/*AFESH367309的MOS强制控制引脚CTL使能状态*/
#define AFESH367309MOS_CONTR_STATE() 		gpio_input_bit_get(AFESH367309MOS_CONTR_GPIO,AFESH367309MOS_CONTR_PIN)

/*仓运状态控制状态*/
#define	WAREHOUSE_STAT_CONTR_STATE()		gpio_input_bit_get(WAREHOUSE_STAT_CONTR_GPIO,WAREHOUSE_STAT_CONTR_PIN)

/*读取按键工作状态*/
#define EN_SKY_STATE()		                gpio_input_bit_get(EN_SKY_GPIO,EN_SKY_PIN)

/*高压Vbat驱动端工作状态*/
#define HIGH_VOLTAGE_DRIVE_ENSTATE()		gpio_input_bit_get(HIGH_VOLTAGE_DRIVE_EN_GPIO,HIGH_VOLTAGE_DRIVE_EN_PIN)

/*PWR工作状态*/
#define EN_PWR_DRIVE_STATE()		gpio_input_bit_get(EN_PWR_GPIO,EN_PWR_PIN)
     

/*插入信号检测*/
#define MS0_DET_READ_STATE()		        gpio_input_bit_get(MS0_DET_STATE_GPIO,MS0_DET_STATE_PIN)


void gd32f4x_gpio_init(void);


typedef void (*afe_alarm_interrupt_callback)(void);
void gd32f4x_gpio_set_afe_alarm_callback(afe_alarm_interrupt_callback alarm_calback);
void gd32f4x_afe_alarm_irq_enable(void);
void gd32f4x_afe_alarm_irq_disable(void);
void gd32f4x_bus_high_voltage_irq_enable(void);
void gd32f4x_bus_high_voltage_irq_disable(void);
void gd32f4x_sky_irq_enable(void);
void gd32f4x_sky_irq_disable(void);
void gd32f4x_input_irq_enable(void);
void gd32f4x_input_irq_disable(void);
uint8_t gd32f4x_key_read(void);

extern uint32_t exitirq_count;

/* 串口调试************************************************************************** */

#define HARDWARE_DEBUG_USART3

#define DRIVER_DEBUG_EN   0 /* 调试打印 1使能 0关闭 */
#if DRIVER_DEBUG_EN
    #define DRIVER_LOG(fmt, ...)   printf(fmt, ##__VA_ARGS__)
#else
    #define DRIVER_LOG(fmt, ...)   ((void)0)
#endif

/* 用于USART （UASRT）和引脚的设置, TX = P, RX = P */
/*与底板的通信口*/
#define USART0_RX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,11) 
#define USART0_RX_GPIO     	   		MCU_GPIO_(GPIO,C)
#define USART0_TX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,10) 
#define USART0_TX_GPIO     	    	MCU_GPIO_(GPIO,C)

#define USART0_TXBUFF_COUNT_MAX			(1024u)	/*串口0的数据发送缓冲区大小*/

/*对外RS485*/
// #define USART2_RX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,9) 
// #define USART2_RX_GPIO     	   		MCU_GPIO_(GPIO,D)
// #define USART2_TX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,8) 
// #define USART2_TX_GPIO     	    	MCU_GPIO_(GPIO,D)
#define USART2_RX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,11) 
#define USART2_RX_GPIO     	   		MCU_GPIO_(GPIO,C)
#define USART2_TX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,10) 
#define USART2_TX_GPIO     	    	MCU_GPIO_(GPIO,C)
void gd_eval_com_init(void);

#define USART2_TXBUFF_COUNT_MAX			(1024u)	/*串口2的数据发送缓冲区大小*/

/*串口屏*/
#define UART3_RX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,11) 
#define UART3_RX_GPIO     	   		MCU_GPIO_(GPIO,C)
#define UART3_TX_PIN          		MCU_GPIO_PIN(GPIO_PIN_,10) 
#define UART3_TX_GPIO     	    	MCU_GPIO_(GPIO,C)

#define RX_DATA_BUFF_QUANTITY         							(1024u)
/*#define TX_DATA_BUFF_QUANTITY         							(500u)*/
#define BMS_MODBUSS_ADD                							(1u)

/* DCDC通信口 */
void gd32f4x_usart0_init(uint32_t baudrate);
void gd32f4x_usart0_enable(void);
void gd32f4x_usart0_disable(void);
uint8_t usart0_send_string(uint8_t *data,uint32_t len);
void usart0_send_data(uint8_t ucch);
uint8_t usart0_send_msg(uint8_t* data, uint16_t len);
void gd32f4x_dcdc_communicate_rxbuffnumber(uint16_t BuffNum);

void gd32f4x_dcdc_communicate_txbuff(uint8_t *TxBuff,uint16_t BuffNum);
uint8_t *gd32f4x_dcdc_communicate_rs485rxbuffadd(void);

typedef void (*fun_usart_recive_callback)(uint8_t* data, uint32_t length);
uint8_t gd32f4x_usart0_set_receive_callback(fun_usart_recive_callback receive_callback);
fun_usart_recive_callback usart2_data_process(uint8_t* data, uint32_t length);

/* RS485通信口 */
void gd32f4x_usart2_init(uint32_t baudrate);
void gd32f4x_usart2_enable(void);
void gd32f4x_usart2_disable(void);
uint8_t usart2_send_string(uint8_t *data,uint32_t len);
void usart2_send_data(uint8_t ucch);
uint8_t usart2_send_msg(uint8_t* data, uint16_t len);

uint8_t *gd32f4x_pc_communicate_rs485rxbuffadd(void);
void gd32f4x_pc_communicate_rxbuffnumber(uint16_t BuffNum);
void gd32f4x_pc_communicate_txbuff(uint8_t *TxBuff,uint16_t BuffNum);

typedef void (*fun_usart_recive_callback)(uint8_t* data, uint32_t length);
uint8_t gd32f4x_usart2_set_receive_callback(fun_usart_recive_callback receive_callback);

/* 调试口或串口屏 */
void gd32f4x_uart3_init(uint32_t baudrate);
void gd32f4x_uart3_enable(void);
void gd32f4x_uart3_disable(void);
void uart3_send_data(uint8_t ucch);
void uart3_send_string(char *str);

