YP-LXL/my-project/src/driver/gd32f4x.h
// typedef void (*fun_usart_recive_callback)(uint8_t* data, uint32_t length);
uint8_t gd32f4x_uart3_set_receive_callback(fun_usart_recive_callback receive_callback);


/* 串口所有初始化 */
void gd32f4x_usart_init(void);


/* DMA************************************************************************** */

#define DMA1_CH0_BUFF_MAX 				(5u)/*DMA0_CH1传输通道最大数据的个数*/
#define USART0_TXBUFF_COUNT_MAX			(1024u)	/*串口0的数据发送缓冲区大小*/
#define USART0_RXBUFF_COUNT_MAX			(1024u)	/*串口0的数据接收缓冲区大小*/

#define USART2_TXBUFF_COUNT_MAX			(1024u)	/*串口2的数据发送缓冲区大小*/
#define USART2_RXBUFF_COUNT_MAX			(4096u)	/*串口2的数据接收缓冲区大小*/

#define UART3_TXBUFF_COUNT_MAX			(1024u)	/*串口3的数据发送缓冲区大小*/
#define UART3_RXBUFF_COUNT_MAX			(1024u)	/*串口3的数据接收缓冲区大小*/

extern uint8_t  Uart3RxBuff[UART3_RXBUFF_COUNT_MAX];			    /*串口3的数据接收缓冲区*/
extern uint8_t  Usart2RxBuff[USART2_RXBUFF_COUNT_MAX];
void gd32f4x_dma_init(void);
void gd32f4x_dma1ch0_init(void);

/* 定时器************************************************************************** */

/*输出 TIMER0_CH1_ON(TIMER0_CH1的互补通道) 蜂鸣器SP1(PWM)，高电平蜂鸣器响，低电平蜂鸣器关。*/

/* 风扇 */
#define FAN_RCU_CLOCK                       RCU_GPIOE
#define FAN_PIN        		                MCU_GPIO_PIN(GPIO_PIN_,5)
#define FAN_PORT       		                MCU_GPIO_(GPIO,E)
#define FAN_AF                              GPIO_AF_3
#define FAN_CHANNEL                         TIMER_CH_0

/* 蜂鸣器 */
#define BUZZER_RCU_CLOCK                    RCU_GPIOB
#define BUZZER_PIN        		            MCU_GPIO_PIN(GPIO_PIN_,0)
#define BUZZER_PORT       		            MCU_GPIO_(GPIO,B)
#define BUZZER_AF                           GPIO_AF_1
#define BUZZER_CHANNEL                      TIMER_CH_1


/* LED(J49-6) RED */
#define LED_J49_6_RCU_CLOCK                 RCU_GPIOC
#define LED_J49_6_PIN          				MCU_GPIO_PIN(GPIO_PIN_,9)
#define LED_J49_6_GPIO         				MCU_GPIO_(GPIO,C)
#define LED_J49_6_AF                        GPIO_AF_2
#define LED_J49_6_CHANNEL                   TIMER_CH_3

/* LED(J49-7) */
#define LED_J49_7_RCU_CLOCK                 RCU_GPIOA
#define LED_J49_7_PIN          			    MCU_GPIO_PIN(GPIO_PIN_,8)
#define LED_J49_7_GPIO         			    MCU_GPIO_(GPIO,A)
#define LED_J49_7_AF                        GPIO_AF_1
#define LED_J49_7_CHANNEL                   TIMER_CH_0


void gd32f4x_timer_init(void);

void gd32f4x_timer2_init(uint32_t usr_hz);
void gd32f4x_timer2_channel_set_duty(uint16_t channel, uint16_t duty);
// void gd32f4x_timer2_led_j49_3_set_duty(uint8_t duty);
// void gd32f4x_timer2_led_j49_4_set_duty(uint8_t duty);
// void gd32f4x_timer2_led_j49_5_set_duty(uint8_t duty);
void gd32f4x_timer2_led_j49_6_set_duty(uint8_t duty);


// void gd32f4x_timer3_channel_set_duty(uint16_t channel, uint16_t duty);
// void gd32f4x_timer3_led_j49_2_set_duty(uint8_t duty);

void gd32f4x_timer4_init(void);

void gd32f4x_timer0_init(uint16_t Prescaler, uint32_t Period, uint32_t BUZZER_Duty, uint32_t LED_Duty);
void gd32f4x_timer0_channel_set_duty(uint16_t channel, uint16_t duty);
void gd32f4x_timer0_led_j49_7_set_duty(uint8_t duty);

void gd32f4x_timer0ch1_set_hz(uint32_t new_hz);
void gd32f4x_timer0ch1_set_pwm_duty(uint8_t duty);

void gd32f4x_timer8_init(uint16_t Prescaler, uint32_t Period, uint32_t Duty);
void gd32f4x_timer8ch0_set_hz(uint32_t new_hz);
void gd32f4x_timer8ch0_set_pwm_duty(uint8_t duty);
extern uint32_t timer4irq_flag;
extern uint32_t timer4irq_count;
extern uint32_t timer4irq_count_flag;
/* ADC采集************************************************************************** */
/*#define	ADC1_PIN								 		MCU_GPIO_PIN(GPIO_PIN_,1)
#define ADC1_GPIO										    MCU_GPIO_(GPIO,B)   

#define	ADC2_PIN										MCU_GPIO_PIN(GPIO_PIN_,0)
#define ADC2_GPIO										    MCU_GPIO_(GPIO,B)*/

#define	ADC3_PIN										MCU_GPIO_PIN(GPIO_PIN_,3)/*I_SENSE+*/
#define ADC3_GPIO            				            MCU_GPIO_(GPIO,A)

#define	ADC4_PIN										MCU_GPIO_PIN(GPIO_PIN_,4)/*CAN,485通讯芯片供电电源的电压采集*/
#define ADC4_GPIO										MCU_GPIO_(GPIO,A)

/*#define	ADC5_PIN										MCU_GPIO_PIN(GPIO_PIN_,7)
#define ADC5_GPIO										    MCU_GPIO_(GPIO,A)

#define	ADC6_PIN										MCU_GPIO_PIN(GPIO_PIN_,6)
#define ADC6_GPIO 									    MCU_GPIO_(GPIO,A)

#define	ADC7_PIN										MCU_GPIO_PIN(GPIO_PIN_,5)							
#define ADC7_GPIO										    MCU_GPIO_(GPIO,A)

#define	ADC8_PIN										MCU_GPIO_PIN(GPIO_PIN_,4)
#define ADC8_GPIO										    MCU_GPIO_(GPIO,A)*/

#define	ADC9_PIN										MCU_GPIO_PIN(GPIO_PIN_,1)/*NTC4*/
#define ADC9_GPIO										 MCU_GPIO_(GPIO,B)

/*#define	ADC10_PIN										MCU_GPIO_PIN(GPIO_PIN_,2)
#define ADC10_GPIO									    MCU_GPIO_(GPIO,A)*/

#define	ADC11_PIN										MCU_GPIO_PIN(GPIO_PIN_,1)/*BOARD_TEMP*/
#define ADC11_GPIO									    MCU_GPIO_(GPIO,C)

#define	ADC12_PIN										MCU_GPIO_PIN(GPIO_PIN_,2)/*BAT.V*/
#define ADC12_GPIO									    MCU_GPIO_(GPIO,C)

/*#define	ADC13_PIN										MCU_GPIO_PIN(GPIO_PIN_,2)
#define ADC13_GPIO									    MCU_GPIO_(GPIO,C)

#define	ADC14_PIN										MCU_GPIO_PIN(GPIO_PIN_,1)
#define ADC14_GPIO									    MCU_GPIO_(GPIO,C)

#define	ADC15_PIN										MCU_GPIO_PIN(GPIO_PIN_,0)
#define ADC15_GPIO									    MCU_GPIO_(GPIO,C)*/

#define	ADC3_GPIO_CLOCK	 					RCU_GPIOA
#define	ADC4_GPIO_CLOCK	 					RCU_GPIOA
#define	ADC9_GPIO_CLOCK	 					RCU_GPIOB
#define	ADC11_GPIO_CLOCK	 			    RCU_GPIOC
#define	ADC12_GPIO_CLOCK	 				RCU_GPIOC

#define ADC_BUFF_COUNT_MAX              (16u)/*存储ADC数据采集数据的个数*/


#define ADC0_CHANNEL_NUMBER             5
void gd32f4x_adc_init(void);
extern uint32_t uiDMAData[DMA1_CH0_BUFF_MAX];


/* CAN0************************************************************************** */
#define MAX_FILTERS 14 
typedef  void(* can0_receive_call_back_func)(can_receive_message_struct* );
typedef  void(* can0_error_handle_call_back_func)();
/* can0的黑白名单功能，最多14个滤波器 */
#define MAX_FILTERS 14 
#define MIN_FILTERS 0
#define BAUD_1000K 5
#define BAUD_500K 10
#define BAUD_250K 20
#define BAUD_100K 50

#define CAN0_RCU_CLOCK RCU_GPIOB
#define CAN0_TX_PORT GPIOB
#define CAN0_RX_PORT GPIOB
#define CAN0_TX_AF GPIO_AF_9
#define CAN0_RX_AF GPIO_AF_9
#define CAN0_TX_PIN GPIO_PIN_9
#define CAN0_RX_PIN GPIO_PIN_8

#define CAN0_INIT_FLAG_NONE 0               /* 未初始化 */
#define CAN0_INIT_FLAG_OK   1               /* 初始化成功 */
#define CAN0_INIT_FLAG_ERR  2               /* 初始化失败 */

#define CAN0_ERR_NONE               (0)      /* 错误标志位-无 */
#define CAN0_ERR_INIT               (1<<0)   /* 错误标志位-初始化 */
#define CAN0_ERR_NO_COMMUNICATION   (1<<1)   /* 错误标志位-超时无通信 */
#define CAN0_ERR_SEND               (1<<2)   /* 错误标志位-发送错误 */
#define CAN0_ERR_NO_COMMUNICATION_TIME_THRESHOLD_DEFAULT  260  /* 默认无通信异常时间阈值默认值 2分钟=120s 单位s */
#define CAN0_ERR_NUM_THRESHOLD_DEFAULT  10  /* 默认发送错误计数阈值 */
typedef struct 
{
    uint8_t  init_flag;                             /* 初始化标志位 0未初始化 1初始化成功 2初始化失败 */
    uint8_t  err_flag;                              /* 发送错误标志位 0无 1错误（触发发送错误数阈值） */
    uint32_t no_communication_time_count;           /* 无通信计时 */
    uint32_t no_communication_time_err_threshold;   /* 无通信异常时间阈值s */
    uint32_t send_err_count;                        /* 发送错误计数，成功一次清零，失败一次计数 */
    uint32_t send_err_num_threshold;                /* 发送错误计数阈值，超过阈值置位发送错误标志位 */
    can0_error_handle_call_back_func err_callback;  /* 异常回调 */
}T_CAN0_ERR_TYPDEF;


void gd32f4x_can0_init(uint32_t baud);
uint8_t can0_check_whitelist_ef(uint32_t* filter_ids, uint8_t num_filters);
uint8_t can0_receive_register(can0_receive_call_back_func call_back);
extern uint8_t can0_send_msg(uint32_t id, uint8_t* data, uint8_t len);
uint8_t can0_error_handle_register(can0_error_handle_call_back_func call_back);
uint8_t can0_check_whitelist_sf(uint32_t* filter_ids, uint8_t num_filters);
void gd32f4x_can0_rx_irqn_enable(void);
void gd32f4x_can0_rx_irqn_disable(void);
 void can0_process_cycle(uint32_t cycle_time);
/* CAN1************************************************************************** */
typedef  void(* can1_receive_call_back_func)(can_receive_message_struct* );
typedef  void(* can1_error_handle_call_back_func)();
/* can1的黑白名单功能，最多14个滤波器 */

