YP-LXL/my-project/src/driver/gd32f4x.h
#define CAN1_RCU_CLOCK RCU_GPIOB
#define CAN1_TX_PORT GPIOB
#define CAN1_RX_PORT GPIOB
#define CAN1_TX_AF GPIO_AF_9
#define CAN1_RX_AF GPIO_AF_9
#define CAN1_TX_PIN GPIO_PIN_13
#define CAN1_RX_PIN GPIO_PIN_12

void gd32f4x_can1_init(uint32_t baud);
uint8_t can1_check_whitelist_ef(uint32_t* filter_ids, uint8_t num_filters);
uint8_t can1_receive_register(can1_receive_call_back_func call_back);
extern uint8_t can1_send_msg(uint32_t id, uint8_t* data, uint8_t len);
uint8_t can1_error_handle_register(can1_error_handle_call_back_func call_back);
uint8_t can1_check_whitelist_sf(uint32_t* filter_ids, uint8_t num_filters);
void gd32f4x_can1_rx_irqn_enable(void);
void gd32f4x_can1_rx_irqn_disable(void);

/* 低功耗睡眠************************************************************************** */
#if 1
#include "gd32f4xx_can.h"
typedef enum
{
    /* 睡眠模式 */
    MCU_MODE_SLEEP,
    /* 深度睡眠模式 */
    MCU_MODE_DEEP_SLEEP,
    /* 待机模式 */
    MCU_MODE_STANDBY
} MCU_SLEEP_MODE_TYPEDEF;

typedef  void(* gd32f4x_after_sleep_init_call_back)();
extern gd32f4x_after_sleep_init_call_back gd32f4x_after_sleep_init;
uint8_t gd32f4x_after_sleep_init_register(gd32f4x_after_sleep_init_call_back call_back);
void gd32f4x_after_sleep_init_func(void);
/* PA0按键触发 */
#define KEY_WAKEUP_PORT         GPIOE
#define KEY_WAKEUP_PIN          GPIO_PIN_2
#define KEY_WAKEUP_EXTI         EXTI_2
#define KEY_WAKEUP_EXTI_PORT    EXTI_SOURCE_GPIOE
#define KEY_WAKEUP_EXTI_PIN     EXTI_SOURCE_PIN2
#define KEY_WAKEUP_PIN_PERIPH   RCU_GPIOE


void gd32f4x_mcu_sleep_enter(MCU_SLEEP_MODE_TYPEDEF mode);
void gd32f4x_after_sleep_init_func(void);
uint8_t gd32f4x_after_sleep_init_register(gd32f4x_after_sleep_init_call_back call_back);
void gd32f4x_key_wakeup_init(void);
void gd32f4x_key_wakeup_enable(void);
void gd32f4x_key_wakeup_disable(void);
void gd32f4x_can0_wakeup_init(void);
void gd32f4x_can0_wakeup_enable(void);
void gd32f4x_can0_wakeup_disable(void);
void gd32f4x_can1_wakeup_init(void);
void gd32f4x_can1_wakeup_enable(void);
void gd32f4x_can1_wakeup_disable(void);
#endif

/* 看门狗************************************************************************** */
#include "gd32f4xx_fwdgt.h"
#include "gd32f4xx_wwdgt.h"

void gd32f4x_fwdgt_init(uint8_t prer, uint16_t rlr);
void gd32f4x_fwdgt_feed(void);
void gd32f4x_fwdgt_init_ms(uint32_t tout_ms);

void gd32f4x_wwdgt_init(uint16_t tr, uint8_t wr, uint32_t fprer);
void gd32f4x_wwdgt_init_ms(uint32_t tout_ms);

/* RTC************************************************************************** */
#include <gd32f4xx_rcu.h>
/* #define RTC_PRINTF */  /* 调试信息打印-有宏定义 RTC_PRINTF 打开打印 无则关闭打印  */
#define BKP_VALUE    0x32F1



extern rtc_parameter_struct rtc_time_structure;

int  gd32f4x_rtc_init(void);
void gd32f4x_rtc_init_alarm_interrupt(void);
void gd32f4x_rtc_wakeup_init(uint16_t wakup_time_s);





/* IIC1************************************************************************** */
/*AFE*/
#define IIC1_PORT_SCL GPIOD
#define IIC1_PORT_SDA GPIOC

#define IIC1_PIN_SCL GPIO_PIN_0
#define IIC1_PIN_SDA GPIO_PIN_12

/*AT8563*/
/*#define IIC2_PORT_SCL GPIOD
#define IIC2_PORT_SDA GPIOD

#define IIC2_PIN_SCL GPIO_PIN_1
#define IIC2_PIN_SDA GPIO_PIN_2*/

uint8_t gd32f4x_i2c1_init(uint32_t clock);
/*uint8_t gd32f4x_i2c2_init(uint32_t clock);*/

extern uint8_t iic1_delay_rate;
/*extern uint8_t iic2_delay_rate;*/


/* SPI************************************************************************** */

#define SPI_RCU_CLOCK RCU_GPIOE
#define SPI_PORT_SCLK GPIOE
#define SPI_PORT_MOSI GPIOE
#define SPI_PORT_MISO GPIOE
#define SPI_PORT_CS   GPIOE

#define SPI_PIN_SCLK GPIO_PIN_9
#define SPI_PIN_MOSI GPIO_PIN_10
#define SPI_PIN_MISO GPIO_PIN_11
#define SPI_PIN_CS   GPIO_PIN_12

#define FLSH_SPI_SCLK(x) do{x?gpio_bit_set(SPI_PORT_SCLK,SPI_PIN_SCLK):gpio_bit_reset(SPI_PORT_SCLK,SPI_PIN_SCLK);}while(0)
#define FLSH_SPI_MOSI(x) do{x?gpio_bit_set(SPI_PORT_MOSI,SPI_PIN_MOSI):gpio_bit_reset(SPI_PORT_MOSI,SPI_PIN_MOSI);}while(0)
#define FLSH_SPI_CS(x)   do{x?gpio_bit_set(SPI_PORT_CS,SPI_PIN_CS):gpio_bit_reset(SPI_PORT_CS,SPI_PIN_CS);}while(0)

#define FLSH_SPI_DELAY_US(x) gd32f4x_delay_us(x)
#define FLSH_SPI_US_DELAY() FLSH_SPI_DELAY_US(2) 

#define FLSH_SPI_READ_SDA() gpio_input_bit_get(SPI_PORT_MISO,SPI_PIN_MISO)

uint8_t gd32f4x_spi_init(void);
uint8_t spi_send_bit(uint8_t data);
uint8_t spi_send_byte(uint8_t data);
uint16_t spi_send_halfword(uint16_t data);
uint8_t spi_receive_bit(void);
uint8_t spi_receive_byte(void);
uint16_t spi_receive_halfword(void);
uint8_t spi_read_write_byte(uint8_t data);
/* GDID************************************************************************** */



#define   STORAGE_INFO       0x1FFF7A20

#define   UNIQUE_ID          0x1FFF7A10

#define   UNIQUE_ID_0_31     0x1FFF7A10
#define   UNIQUE_ID_32_63    0x1FFF7A14
#define   UNIQUE_ID_64_95    0x1FFF7A18

void gd32f4x_read_id(void);

uint16_t rs485_datacrc16(uint8_t *puchMsg, uint16_t usDataLen);

#endif
